Revit 2024 API
MEPSystem.ConnectorManager Property
Connector manager of the system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ConnectorManager ConnectorManager { get; }
Visual Basic
Public ReadOnly Property ConnectorManager As ConnectorManager
	Get
Visual C++
public:
property ConnectorManager^ ConnectorManager {
	ConnectorManager^ get ();
}
Remarks
The connector manager includes connectors which are used to connect with terminal elements and base equipment.
See Also
MEPSystem Class
Autodesk.Revit.DB Namespace